calm water resistance/KCS/Fr0.2274/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version    2.0;
	format     ascii;
	class      dictionary;
	object     blockMeshDict;
}

scale 1;

vertices
(
	(-14.586403950235104 0 -8.204852222007245)
	(21.879605925352653 0 -8.204852222007245)
	(21.879605925352653 9.11650246889694 -8.204852222007245)
	(-14.586403950235104 9.11650246889694 -8.204852222007245)
	(-14.586403950235104 0 3.6466009875587755)
	(21.879605925352653 0 3.6466009875587755)
	(21.879605925352653 9.11650246889694 3.6466009875587755)
	(-14.586403950235104 9.11650246889694 3.6466009875587755)
);

edges
(

);

blocks
(
	hex (0 1 2 3 4 5 6 7) (120 30 39) simpleGrading (1 1 1)
);

boundary
(
	inlet
	{
		type patch;
		faces
		(
			(0 4 7 3)
			(3 2 6 7)
			(0 3 2 1)
		);
	}
	midPlane
	{
		type symmetryPlane;
		faces
		(
			(0 1 5 4)
		);
	}
	outlet
	{
		type patch;
		faces
		(
			(2 6 5 1)
		);
	}
	top
	{
		type patch;
		faces
		(
			(4 5 6 7)
		);
	}
);

